# PANDAS -- DATAFRAME AND SERIES

#### Series - one dimensionsal array object and Dataframe two dimensional size mutable.

In [3]:
import pandas as pd

In [4]:
#Series

data=[1,2,3,4,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
data = {'a':1, 'b':2, 'c': 3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
## To manipulation in excel files as we have so many rows and columns present.
data=[10,20,30]
index = ['a','b','c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
# Dataframe -- Two dimensional, mutable- similar to tables -- multiple rows and columns
## Create a Dataframe from a dictionery of list


data ={
    'Name':['Manya', 'Ambitious', 'Strong'],
    'Age': [1,2,3],
    'City':['UK', 'US', 'Canada']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

        Name  Age    City
0      Manya    1      UK
1  Ambitious    2      US
2     Strong    3  Canada
<class 'pandas.core.frame.DataFrame'>

In [8]:
## Skipped the column names

import numpy as np
np.array(df)

array([['Manya', 1, 'UK'],
       ['Ambitious', 2, 'US'],
       ['Strong', 3, 'Canada']], dtype=object)

In [9]:
## Create a Data Frame from a List of Dictionaries

data=[
    {'Name': 'Manya', 'Age':20, 'City':'Australia'},
    {'Name': 'Sanya', 'Age':22, 'City':'Delhi'},
    {'Name': 'Vanya', 'Age':32, 'City':'UK'},
    {'Name': 'Tanya', 'Age':32, 'City':'USA'}
]

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Manya   20  Australia
1  Sanya   22      Delhi
2  Vanya   32         UK
3  Tanya   32        USA
<class 'pandas.core.frame.DataFrame'>

In [10]:
## Accesing a specified element using iat

df.iat[2,2]

'UK'

In [12]:
df.at[1,'City']

'Delhi'

In [13]:
## Data Manipulation with DataFrame
df

    Name  Age       City
0  Manya   20  Australia
1  Sanya   22      Delhi
2  Vanya   32         UK
3  Tanya   32        USA

In [14]:
df['Salary']=[1000000,20000,23333,43545]

In [15]:
df

    Name  Age       City   Salary
0  Manya   20  Australia  1000000
1  Sanya   22      Delhi    20000
2  Vanya   32         UK    23333
3  Tanya   32        USA    43545

In [23]:
## Inplace - Permanantly delete the column
df.drop('Age', axis=1, inplace = True)

KeyError: "['Age'] not found in axis"

In [22]:
df

    Name       City   Salary
0  Manya  Australia  1000000
1  Sanya      Delhi    20000
2  Vanya         UK    23333
3  Tanya        USA    43545